{
  "home": {
    "header": {
      "title": "Dominique Börner",
      "text": "Bereits mit 14 Jahren habe ich meine Leidenschaft für Webdesign und Webentwicklung entdeckt. Während der Ausbildung auch unter dem Spitznamen »Meister Bling-Bling« bekannt, wuchs mein Drang mich immer tiefer und tiefer in die Thematik einzuarbeiten. Während der Zeit des mobilen wandels aufgewachsen zu sein half mir dabei. So sind »Mobile First« und »Responsive Design« für mich gang und gäbe und gehören zum Standard.",
      "about-me": "Über mich"
    },
    "ux": {
      "title": "Webentwicklung mit Fokus auf UI/UX Design",
      "text": "Webanwendungen und Webseiten sollten so einfach wie möglich für verschiedenste Nutzergruppen entwickelt werden. A/B-Tests und Nutzergruppenanalyse sind für mich keine Fremdworte und gehören zur Front-End Entwicklung genauso dazu, wie das programmieren an sich."
    },
    "testing": {
      "title": "Testgetriebene Entwicklung",
      "text": "Rot und Grün sind für mich nicht nur Ampelfarben, sondern eine Unterstützung bei der Entwicklung von qualitativer Software. Deshalb setze ich bei Webanwendungen vor allem auf Jest und Cypress."
    },
    "design-system": {
      "title": "Umsetzung von Design-Systemen",
      "text": "Um den Nutzer*innen ein möglichst gleiches Gefühl von Software zu vermitteln, entwickle ich Design-Systeme mithilfe von Storybook. Hierbei setze ich vor allem auf das Konzept von Atomic Design um Elemente wiederverwendbar aber flexibel zu gestalten."
    },
    "technologies": {
      "title": "Meine Technologien",
      "text": "Um das bestmögliche Ergebnis zu erzielen, setze ich immer die passende Technologie ein. Hierbei kann ich auf ein großes Portfolio an Wissen zurückgreifen."
    }
  },
  "design": {
    "title": "Handgefertigte Komponenten",
    "text": "Jede Webseite benötigt Ihren eigenen Stil, daher sind die Elemente meines Portfolios alle selbst entwickelt worden und basieren nicht auf gängigen Komponenten-Bibliotheken. Um die Entwicklung der einzelnen Komponenten zu beschleunigen, setze ich seit nun mittlerweile vielen Jahren auf TailwindCSS. Auf den folgenden Seiten erläutere ich, was ich mir beim Design der einzelnen Elemente gedacht habe. Der Quellcode steht selbstverständlich öffentlich auf GitHub zur Verfügung.",
    "typography": {
      "card-title": "Typography",
      "card-text": "Wie wurde Typography implementiert?"
    }
  }
}
